
from django.utils.translation import gettext as _

SALARY_TABLES = (
    ('GS1', '行（一）'),
    ('GS2', '行（二）'),
    ('SGS', '専門行政'),
    ('ZM',  '税務'),
    ('KA1', '公安（一）'),
    ('KA2', '公安（二）'),
    ('KJ1', '海（一）'),
    ('KJ2', '海（二）'),
    ('KI1', '教（一）'),
    ('KI2', '教（二）'),
    ('KK',  '研究'),
    ('IR1', '医（一）'),
    ('IR2', '医（二）'),
    ('IR3', '医（三）'),
    ('FS',  '福祉'),
    ('NK1', '任研（一）'),      # 任期付き研究員
    ('NK2', '任研（二）'),
    ('TNK', '特任研'),          # 特定任期付き研究員
    ('SS',  '専門スタッフ'),
    ('ST',  '指定'),            # 指定職
)

STAFF_TYPE = (                  # 職員の区分
    ('TY', '定員'),
    ('SNY', '再任用'),
)